Revit 2024 API
BuiltInFailures.OverlapFailures.WallsOverlap Property
 Highlighted walls overlap. One of them may be ignored when Revit finds room boundaries. Use Cut Geometry to embed one wall within the other.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WallsOverlap { get; }
Visual Basic
Public Shared ReadOnly Property WallsOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WallsOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace